// Lab_03_1.cpp
// Siliava Oleksandr
// Лабораторна робота № 3.1
// Розгалуження, задане формулою: функція однієї змінної.
// Варіант 26



#include <iostream>
#include <cmath>

using namespace std;

int main() {
    // Оголошення змінних
    double x, y, A, B;

    // Введення значення x з клавіатури
    cout << "Введіть значення х: ";
    cin >> x;

    // Обчислення значення A
    A = 3 * x + 2;

    // Обчислення значення B – функціонально змінної частини виразу
    // Спосіб 1: розгалуження в скороченій формі
     if (x <= -3.5) 
     B = x * x + 4;
     if (-3.5  < x && x <= 1)
     B = 4.95 * x * x + atan2(2 * x + 3.5, 5);
     if (x>1)
     B = cos(3 * x) - sin(x);
    

    // Обчислення значення y
    y = A + B;

    // Вивід значення y на екран
    cout << endl;
    cout << "1) y =  " << y << endl;

    // Обчислення значення B – функціонально змінної частини виразу
    // Спосіб 2: розгалуження в повній формі
    if (x <= -3.5) {
        B = x * x + 4;
    }
    else if (x > 1) {
        B = cos(3 * x) - sin(x);
    }
    else {
        B = 4.95 * x * x + atan2(2 * x + 3.5, 5);
    }
            
        
    
    
    // Обчислення значення y
    y = A + B;

    // Вивід значення y на екран
    cout << "1) y = " << y << endl;

    return 0;
}
